### Terraform Plan — `sit` ✅

<details><summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_orgs.github_enterprise_organization.this["login"] will be created
  + resource "github_enterprise_organization" "this" {
      + admin_logins  = [
          + "apshhayasg",
        ]
      + billing_email = "akshhaya's@paloit.com"
      + database_id   = (known after apply)
      + description   = "NA"
      + display_name  = "org1"
      + id            = (known after apply)
      + name          = "login"
        # (1 unchanged attribute hidden)
    }

  # module.github_repos.github_branch_default.this["Akshhay"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "Akshhay"
    }

  # module.github_repos.github_repository.this["Akshhay"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "Akshhay"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Akshhay"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Akshhay"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>